/* Copyright (c)  2019-2025 Wuhan Nameless Innovation Technology Co.,Ltd. All rights reserved.*/
/*----------------------------------------------------------------------------------------------------------------------/
开源并不等于免费，先驱者的历史已经证明，在国内这个环境下，毫无收益的开源，单靠坊间个人爱好者，自发地参与项
目完善的方式行不通，好的开源项目需要请专职人员做好售后服务、手把手教学、统计用户反馈需求、在实践中完成对产
品的一次次完善与迭代升级。经过综合考虑，无名飞控开源代码中，程序仅保留公司正版激活功能代码，版本激活无实际
功能，属于公司产品常规出厂操作，不影响客户学习，其余代码全部开放给客户学习，客户移植和二次开发代码请保留代
码版权。
-----------------------------------------------------------------------------------------------------------------------/
*               本程序只供购买者学习使用，版权著作权属于无名科创团队，无名科创团队将飞控程序源码提供给购买者，
*               购买者要为无名科创团队提供保护，未经作者许可，不得将源代码提供给他人，不得将源代码放到网上供他人免费下载， 
*               更不能以此销售牟利，如发现上述行为，无名科创团队将诉之以法律解决！！！
-----------------------------------------------------------------------------------------------------------------------
*                                                 为什么选择无名创新？
*                                         感动人心价格厚道，最靠谱的开源飞控；
*                                         国内业界良心之作，最精致的售后服务；
*                                         追求极致用户体验，高效进阶学习之路；
*                                         萌新不再孤单求索，合理把握开源尺度；
*                                         响应国家扶贫号召，促进教育体制公平；
*                                         新时代奋斗最出彩，建人类命运共同体。 
-----------------------------------------------------------------------------------------------------------------------
*               生命不息、奋斗不止；前人栽树，后人乘凉！！！
*               开源不易，且学且珍惜，祝早日逆袭、进阶成功！！！
*               学习优秀者，简历可推荐到DJI、ZEROTECH、XAG、AEE、GDU、AUTEL、EWATT、HIGH GREAT等公司就业
*               求职简历请发送：15671678205@163.com，需备注求职意向单位、岗位、待遇等
*               无名科创开源飞控QQ群：2号群465082224、1号群540707961（人员已满）
*               CSDN博客：http://blog.csdn.net/u011992534
*               优酷ID：NamelessCotrun无名小哥
*               B站教学视频：https://space.bilibili.com/67803559/#/video
*               客户使用心得、改进意见征集贴：http://www.openedv.com/forum.php?mod=viewthread&tid=234214&extra=page=1
*               淘宝店铺：https://shop348646912.taobao.com/?spm=2013.1.1000126.2.5ce78a88ht1sO2
*               百度贴吧:无名科创开源飞控
*               公司官网:www.nameless.tech
*               无名创新国内首款TI开源飞控设计初衷、知乎专栏:https://zhuanlan.zhihu.com/p/54471146
*               修改日期:2020/10/24                   
*               版本：慧飞者PRO——WisdomPilot_Pro_V1.0.0
*               版权所有，盗版必究。
*               Copyright(C) 2019-2025 武汉无名创新科技有限公司 
*               All rights reserved
-----------------------------------------------------------------------------------------------------------------------
*               重要提示：
*               正常淘宝咸鱼转手的飞控、赠送朋友、传给学弟的都可以进售后群学习交流，
*               不得直接在网上销售无名创新资料，无名创新代码有声明版权，他人不得将
*               资料代码传网上供他人下载，不得以谋利为目的销售资料代码，发现有此操
*               作者，公司会提前告知，请1天内及时处理，否则你的学校、单位、姓名、电
*               话、地址信息会被贴出在公司官网、官方微信公众平台、官方技术博客、知乎
*               专栏以及淘宝店铺首页予以公示公告，此种所作所为，会成为个人污点，影响
*               升学、找工作、社会声誉、很快就很在无人机界出名，后果很严重。
*               因此行为给公司造成重大损失者，会以法律途径解决，感谢您的合作，谢谢！！！
----------------------------------------------------------------------------------------------------------------------*/
/*************************************************************************************************************************
//----------------------------------------------------------------------------------------------------------------------//
*		无名创新——慧飞者	
*		MCU: 	STM32F103RCT6  72MHz
*		慧飞者——板载硬件资源接口映射表:
*		默认IMU(MPU6050 + IST8310 + SPL06_001):
*				IMU_SCL						-->	PB6
*				IMU_SDA						-->	PB7
*               备用I2C口：
*				I2C_SCL						-->	PC4
*				I2C_SDA						-->	PC5
*		OLED:支持I2C/SPI量程模式
*				OLED_D0/OLED_SCL				-->	PC3
*				OLED_D1/OLED_SDA				-->	PC2
*				OLED_RST					-->	PC1
*				OLED_DC						-->	PC0
*				OLED_CS						-->	GND
*		电调输出:(当IMU I2C口接备用I2C口时，可输出8路PWM)
*				MOTOR1						-->	PB1	-->	TIM3_CH1
*				MOTOR2						-->	PB0	-->	TIM3_CH2
*				MOTOR3						-->	PA7	-->	TIM3_CH3
*				MOTOR4						-->	PA6	-->	TIM3_CH4
*				MOTOR5						-->	PB8	-->	TIM4_CH3
*				MOTOR6						-->	PB9	-->	TIM4_CH4
*				MOTOR7						-->	PB6	-->	TIM4_CH1
*				MOTOR8						-->	PB7	-->	TIM4_CH2
*		RC输入:
*				PPM信号					  -->	PA8	-->	EXTI
*				SBUS信号					-->	PD2 -->	USART5_RX
*		超声波:
*				TRIG						            -->	PA0     
*				ECHO											  -->	PA1     
*		按键:
*				S1													-->	PA15
*				S2													-->	PB3
*		LED指示灯:
*				LED2(Green)			            -->	PB12
*				LED3(Blue)				        	-->	PB13
*				LED4(Yellow)			          -->	PB14
*				LED5(Red)			              -->	PB15
*		电压检测端口：
*				ADC_IN			                -->	PA4
*		SWD调试下载口（3.3V供电）：
*				SWDIO			                  -->	PA13
*				SWCLK				                -->	PA14
*		USB虚拟串口：
*				USB_DM			                  -->	PA11
*				USB_DP				                -->	PA12
*		USART1(5V供电)  山外多功能调试助手  &  Mavlink
*				USART1_TX				        -->	PA9
*				USART1_RX				        -->	PA10
*		USART2(5V供电)  外接GPS
*				USART2_TX				        -->	PA2
*				USART2_RX				        -->	PA3
*		USART3(5V供电)  备用串口扩展：Openmv、SDK开发
*				USART3_TX				        -->	PB10
*				USART3_RX				        -->	PB11
*		USART4(5V供电)  光流传感器
*				USART4_TX				        -->	PC10
*				USART4_RX				        -->	PC11
*		预留IO口
*				IO1				                -->	PC13
*				IO2				                -->	PC14
*				IO3				                -->	PC15
*				IO4				                -->	PB4
************************************************************************************************************************/
/***************************While(1)里面只进行按键、显示、标定等程序****************************************************/
/***************************主要核心：传感器滤波、姿态解算、惯导、控制等代码在TIME.c里面运行**********************************/


#include "Headfile.h"
int main()
{
  NCQ_Init();//硬件资源+相关外设初始化
  while(1)
  {
    Key_Scan(Key_Right_Release);             //按键扫描
    QuadShow();															 //显示屏刷新
    Save_Or_Reset_Parameter();					     //运用地面站，修改控制参数
    Accel_Calibartion();										 //加速度计标定
    Mag_Calibartion_LS(DataMag,Circle_Angle);//最小二乘法磁力计球面拟合
    RC_Calibration_Check(PPM_Databuf);			 //遥控器行程标定
#if (SD_Log_Enable)
    NC_Flight_Log();                         //SD卡写飞行日志文件
#endif		
  }
}
/******************************觉得很有帮助，欢迎打赏一碗热干面（武科大二号门老汉口红油热干面4元一碗），无名小哥支付宝：1094744141@qq.com**************************************************/
/******************************由于街道市容整改，原二号门热干面摊已拆除，欢迎打赏一瓶————和其正**************************************************/

